; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj14 - airport
	obj1 obj15 - city
	obj2 obj11 obj12 obj16 - truck
	obj3 obj4 obj5 obj6 obj8 - airplane
	obj7 obj10 - package
	obj9 obj13 - location
)

(:init
	(in-city obj9 obj1)
	(at obj2 obj0)
	(at obj10 obj9)
	(at obj16 obj14)
	(at obj4 obj0)
	(at obj5 obj0)
	(at obj6 obj0)
	(at obj11 obj9)
	(in-city obj0 obj1)
	(at obj12 obj0)
	(in-city obj13 obj1)
	(at obj8 obj0)
	(in-city obj14 obj15)
	(at obj7 obj0)
	(at obj3 obj0)
)

(:goal (and
	(at obj7 obj14)
	(at obj10 obj14)
))
)

; plan
1. (load obj8 obj7 obj0)
   deleted: (at obj7 obj0)
   added: (in obj7 obj8)
   goals met: 0 of 2
2. (load obj11 obj10 obj9)
   deleted: (at obj10 obj9)
   added: (in obj10 obj11)
   goals met: 0 of 2
3. (drive obj11 obj9 obj0)
   deleted: (at obj11 obj9)
   added: (at obj11 obj0)
   goals met: 0 of 2
4. (unload obj11 obj10 obj0)
   deleted: (in obj10 obj11)
   added: (at obj10 obj0)
   goals met: 0 of 2
5. (load obj8 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj8)
   goals met: 0 of 2
6. (fly obj8 obj0 obj14)
   deleted: (at obj8 obj0)
   added: (at obj8 obj14)
   goals met: 0 of 2
7. (unload obj8 obj7 obj14)
   deleted: (in obj7 obj8)
   added: (at obj7 obj14)
   goals met: 1 of 2
8. (unload obj8 obj10 obj14)
   deleted: (in obj10 obj8)
   added: (at obj10 obj14)
   goals met: 2 of 2
